const tableprovince = [
  {
    cell01: "กรุงเทพมหานคร",
    cell02: "123,456",
  },
  {
    cell01: "สมุทรปราการ",
    cell02: "123,456",
  },
  {
    cell01: "สมุทรสงคราม",
    cell02: "123,456",
  },
  {
    cell01: "สถพรรณบุรี",
    cell02: "123,456",
  },
  {
    cell01: "ราชบุรี",
    cell02: "123,456",
  },
  {
    cell01: "เพชรบุรี",
    cell02: "123,456",
  },
  {
    cell01: "ชุมพร",
    cell02: "123,456",
  },
  {
    cell01: "เชียงใหม่",
    cell02: "123,456",
  },
  {
    cell01: "เชียงราย",
    cell02: "123,456",
  },
  {
    cell01: "ชลบุรี",
    cell02: "123,456",
  },
  {
    cell01: "กรุงเทพมหานคร",
    cell02: "123,456",
  },
  {
    cell01: "กรุงเทพมหานคร",
    cell02: "123,456",
  },
  {
    cell01: "กรุงเทพมหานคร",
    cell02: "123,456",
  },
  {
    cell01: "กรุงเทพมหานคร",
    cell02: "123,456",
  },
];

export default tableprovince;
