const tablezone = [
  {
    cell01: "เขตสุขภาพ 1",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 2",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 3",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 3",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 4",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 5",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 6",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 7",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 8",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 9",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 10",
    cell02: "123,456",
  },
  {
    cell01: "เขตสุขภาพ 11",
    cell02: "123,456",
  },
];

export default tablezone;
