const tableexercise = [
  {
    cell01: "เดิน - วิ่ง",
    cell02: "123,456",
    cell03: "1,000,000",
    cell04: "1,000,000",
  },
  {
    cell01: "เดิน - วิ่ง",
    cell02: "123,456",
    cell03: "1,000,000",
    cell04: "1,000,000",
  },
  {
    cell01: "เดิน - วิ่ง",
    cell02: "123,456",
    cell03: "1,000,000",
    cell04: "1,000,000",
  },
  {
    cell01: "เดิน - วิ่ง",
    cell02: "123,456",
    cell03: "1,000,000",
    cell04: "1,000,000",
  },
  {
    cell01: "เดิน - วิ่ง",
    cell02: "123,456",
    cell03: "1,000,000",
    cell04: "1,000,000",
  },
  {
    cell01: "เดิน - วิ่ง",
    cell02: "123,456",
    cell03: "1,000,000",
    cell04: "1,000,000",
  },
];

export default tableexercise;
