import { Box, makeStyles, Typography } from "@material-ui/core";
import { ButtonProps } from "components/common/button";
import InnerLayout from "components/layouts/InnerLayout/InnerLayout";
import React from "react";
import prefix from "utils/path";

const useStyles = makeStyles(() => ({
  root: {
    maxWidth: 700,
    margin: "0 auto",
    borderRadius: 5,
    boxShadow: "0 3px 6px rgba(0,0,0,0.16)",
    padding: 30,
    backgroundColor: "#fff",
  },
  boxConditions: {
    height: 400,
    overflow: "auto",
    border: "1px solid #eee",
    marginBottom: 30,
    padding: 20,
    "& h3": {
      color: "#70B642",
      fontSize: 34,
      lineHeight: "34px",
      textAlign: "center",
      marginBottom: 15,
    },
    "& p": {
      textIndent: "30px",
      marginBottom: 10,
    },
  },
  imageLogin: {
    marginBottom: 20,
    textAlign: "center",
  },
}));

const ConditionsPage = () => {
  const classes = useStyles();
  return (
    <InnerLayout>
      <Box className={classes.root}>
        <Box className={classes.imageLogin}>
          <img src={`${prefix}/images/logo.png`} alt="" />
        </Box>
        <Box className={classes.boxConditions}>
            <Typography variant="h3">ข้อกำหนดและเงื่อนไข</Typography>
            <Typography variant="body1">
              ข้าพเจ้า ได้ทำความเข้าใจอย่างละเอียดในข้อกำหนดและเงื่อนไขการใช้บริการ Web Application “ก้าวท้าใจ”
              ตามรายละเอียดการให้บริการที่กรมอนามัย กระทรวงสาธารณสุขกำหนด โดย รับทราบ ยอมรับ
              และตกลงที่จะผูกพันและปฏิบัติตามข้อกำหนดและเงื่อนไขการใช้บริการ ดังต่อไปนี้
            </Typography>
            <Typography variant="h4">1. คํานิยาม</Typography>
            <Typography variant="body2">
              1.1 “ข้อมูลส่วนบุคคล” หมายความว่า ข้อมูลเกี่ยวกับผู้ใช้บริการซึ่งทำให้สามารถระบุตัวตนของ
              ผู้ใช้บริการได้ ไม่ว่าทางตรงหรือทางอ้อม ซึ่งรวมถึงข้อมูลทั่วไปของผู้ใช้บริการ ข้อมูลที่ใช้ยืนยันตัวตน ข้อมูลสุขภาพ ข้อมูลการออกกำลังกาย
              และข้อมูลส่วนบุคคลอื่นใดเกี่ยวกับผู้ขอใช้บริการ ตามกฎหมายว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล ทั้งนี้ ไม่รวมถึงข้อมูลเกี่ยวกับผู้ขอใช้บริการในกรณีที่ผู้ใช้บริการถึงแก่กรรม
            </Typography>
            <Typography variant="body2">
              1.2“ผู้ใช้บริการ” หมายความว่า ผู้ที่เข้าใช้บริการ Web Application “ก้าวท้าใจ” ของกรมอนามัย กระทรวงสาธารณสุข
            </Typography>
            <Typography variant="body2">
              1.3“ข้อมูลที่ใช้ยืนยันตัวตน” หมายความว่า รหัสผ่าน (password), Personal Identification Number (PIN)
              หรือรหัสหรือข้อมูลอื่นใดที่ใช้สำหรับการตรวจสอบและยืนยันตัวตนในการเข้าถึงและใช้บริการ Web Application “ก้าวท้าใจ”
              ซึ่งเป็นมาตรการป้องกันการเข้าถึงโดยมิชอบโดยบุคคลอื่น ไม่ว่าจะถูกกำหนดโดยหน่วยบริการ หรือผู้ขอใช้บริการเป็นผู้กำหนดเองก็ตาม
              ตลอดจนข้อมูลที่ใช้ในการกู้คืนรหัส หรือข้อมูลดังกล่าว (ถ้ามี)
            </Typography>
            <Typography variant="body2">
              1.4“กรมอนามัย” หมายความว่า หน่วยงานส่วนกลางกรมอนามัยและหน่วยงานภายใต้สังกัดของกรมอนามัย
            </Typography>
            <Typography variant="h4">2. วัตถุประสงค์ในการเก็บรวบรวมและใช้ข้อมูลส่วนบุคคลของผู้ใช้บริการ</Typography>

            <Typography variant="body2">
              2.1 เพื่อให้บริการด้านการส่งเสริมสุขภาพและอนามัยสิ่งแวดล้อม การส่งเสริมความรอบรู้ด้านสุขภาพ
              การส่งเสริมกิจกรรมทางกาย การประเมินภาวะสุขภาพเบื้องต้น
            </Typography>
            <Typography variant="body2">
              2.2 เพื่อใช้เป็นหลักฐานในการเข้าร่วมกิจกรรม “ก้าวท้าใจ”
              รวมถึงการจัดส่งและรับของรางวัลจากกิจกรรมในกรณีที่ได้รับรางวัล
            </Typography>
            <Typography variant="body2">
              2.3 เพื่อการศึกษาวิจัยปัจจัยที่มีผลต่อการใช้ดิจิทัลแพลตฟอร์มในการส่งเสริมสุขภาพ
              เพื่อนำผลการศึกษาวิจัยมาใช้ในการพัฒนาปรับปรุงการให้บริการ Web Application “ก้าวท้าใจ”
            </Typography>

            <Typography variant="h4">3. ข้อมูลส่วนบุคคลที่กรมอนามัยเก็บรวบรวม</Typography>
            <Typography variant="body2">
              เพื่อวัตถุประสงค์ตามที่ได้แจ้งในข้อ 2 กรมอนามัยเก็บรวบรวมข้อมูลส่วนบุคคลของผู้ใช้บริการ ได้แก่
              ชื่อ นามสกุล เบอร์โทรศัพท์ เลขบัตรประชาชน เพศ วันเดือนปีเกิด สถานะ ที่อยู่ปัจจุบัน ที่อยู่ทะเบียนบ้าน เป็นต้น ข้อมูลที่ใช้ยืนยันตัวตน
              ข้อมูลสุขภาพ ได้แก่ น้ำหนัก ส่วนสูง ค่าดัชนีมวลกาย ผลการคัดกรองสุขภาพ เป็นต้น ข้อมูลการออกกำลังกาย ได้แก่ ประเภทกีฬา
              ระยะทาง ระยะเวลา ค่าการเผาผลาญพลังงาน พฤติกรรมการออกกำลังกาย เป็นต้น
            </Typography>

            <Typography variant="h4">4. การเปิดเผยข้อมูลของผู้ใช้บริการ</Typography>
            <Typography variant="body2">
              กรมอนามัยอาจเปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการต่อประเภทของบุคคลและช่องทางดังต่อไปนี้
            </Typography>
            <Typography variant="body2">
              4.1 หน่วยงานภายใต้สังกัดกรมอนามัย กระทรวงสาธารณสุข เช่น ศูนย์อนามัยเข้าถึงข้อมูลของผู้ใช้งานในพื้นที่รับผิดชอบ เพื่อนำไปพัฒนาการดำเนินงานส่งเสริมกิจกรรมทางกาย
            </Typography>
            <Typography variant="body2">
              4.2 หน่วยงานเครือข่าย เช่น กรณีหน่วยงานร้องขอเป็นหนังสือมายังกรมอนามัยขอให้จัดส่งรายงานผู้ใช้งาน เพื่อนำใช้ในการส่งเสริมกิจกรรมทางกาย
            </Typography>
            <Typography variant="body2">
              4.3 หน่วยงานผู้พัฒนาระบบ ซึ่งมีความจำเป็นต่อการให้บริการ Web Application “ก้าวท้าใจ”
            </Typography>
            <Typography variant="body2">
              ประกาศต่อสาธารณะ ในการประกาศรายชื่อผู้ได้รับรางวัลจากกิจกรรม “ก้าวท้าใจ” เช่น Ebib
              ชื่อ เบอร์โทร(บางส่วน) ตำบล อำเภอ จังหวัด เป็นต้น ผ่านเว็บไซต์ของก้าวท้าใจ
              (https://activefam.anamai.moph.go.th) และ Facebook Fanpage “ก้าวท้าใจ”
            </Typography>

            <Typography variant="h4">5. แนวทางในการดำเนินการคุ้มครองข้อมูลส่วนบุคคล</Typography>
            <Typography variant="body2">
              กรมอนามัยจะกำหนดมาตรการต่าง ๆ รวมถึงมาตรการด้านการรักษาความมั่นคงปลอดภัยของข้อมูลส่วนบุคคลที่สอดคล้องกับกฎหมาย
              ระเบียบ หลักเกณฑ์ และแนวปฏิบัติด้านการคุ้มครองข้อมูลส่วนบุคคลให้แก่ เจ้าหน้าที่สังกัดของกรมอนามัยและบุคคลอื่นที่เกี่ยวข้อง
              รวมถึงสนับสนุนและส่งเสริมให้พนักงานเจ้าหน้าที่มีความรู้และตระหนักถึงหน้าที่และความรับผิดชอบในการเก็บรวบรวม การจัดเก็บรักษา
              การใช้ และการเปิดเผยข้อมูลส่วนบุคคลของเจ้าของข้อมูล เพื่อให้กรมอนามัยสามารถปฏิบัติตามนโยบายและกฎหมายคุ้มครองข้อมูลส่วนบุคคลได้อย่างถูกต้องและมีประสิทธิภาพ
            </Typography>

            <Typography variant="h4">6. สิทธิของเจ้าของข้อมูลส่วนบุคคล</Typography>
            <Typography variant="body2">
              เจ้าของข้อมูลส่วนบุคคลมีสิทธิในการดำเนินการ ดังต่อไปนี้
            </Typography>
            <Typography variant="body2">
              6.1 สิทธิในการเพิกถอนความยินยอมในการประมวลผลข้อมูลส่วนบุคคล
            </Typography>
            <Typography variant="body2">
              6.2 สิทธิในการเข้าถึงข้อมูลส่วนบุคคลและขอทำสำเนาข้อมูลส่วนบุคคล
              รวมถึงการขอให้เปิดเผยการได้มาซึ่งข้อมูลส่วนบุคคลที่ไม่ได้ให้ความยินยอม
            </Typography>
            <Typography variant="body2">
              6.3 สิทธิในการขอแก้ไขข้อมูลส่วนบุคคล กรณีที่ข้อมูลไม่ถูกต้องหรือไม่ครบถ้วน
              เพื่อให้มีความถูกต้อง เป็นปัจจุบัน สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด
            </Typography>
            <Typography variant="body2">
              6.4 สิทธิในการลบข้อมูลส่วนบุคคล กรณีที่เจ้าของข้อมูลไม่ได้ใช้บริการอีกต่อไป
              หรือ ข้อมูลส่วนบุคคลได้รับการประมวลผลโดยมิชอบด้วยกฎหมาย
            </Typography>
            <Typography variant="body2">
              6.5 สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล
            </Typography>
            <Typography variant="body2">
              6.6 สิทธิในการให้โอนย้ายข้อมูลส่วนบุคคล
            </Typography>
            <Typography variant="body2">
              6.7 สิทธิในการคัดค้านการประมวลผลข้อมูลส่วนบุคคล
            </Typography>
            <Typography variant="body2">
              เจ้าของข้อมูลสามารถขอใช้สิทธิดังกล่าวข้างต้นได้ โดยยื่นคำร้องขอใช้สิทธิต่อกรมอนามัยเป็นลายลักษณ์อักษรหรือผ่านทางจดหมายอิเล็กทรอนิกส์
              ผ่าน “ช่องทางการติดต่อของกรมอนามัย” ด้านล่าง โดยกรมอนามัยจะพิจารณาและแจ้งผลการพิจารณาตามคำร้องฯ ของเจ้าของข้อมูล
              ภายใน 30 วัน นับแต่วันที่ได้รับคำร้องฯ ดังกล่าว ทั้งนี้ กรมอนามัยอาจปฏิเสธสิทธิของเจ้าของข้อมูลได้ในกรณีที่มีกฎหมายกำหนดไว้
            </Typography>


            <Typography variant="h4">7. การเปลี่ยนแปลงข้อกำหนดและเงื่อนไข</Typography>
            <Typography variant="body2">
              กรมอนามัยอาจทำการปรับปรุงหรือแก้ไขนโยบายนี้เป็นครั้งคราว เพื่อให้สอดคล้องกับข้อกำหนดตามกฎหมาย
              การเปลี่ยนแปลงการดำเนินงานของกรมอนามัย รวมถึงข้อเสนอแนะและความคิดเห็นจากหน่วยงานต่าง ๆ
              โดยกรมอนามัยจะประกาศแจ้งการเปลี่ยนแปลงให้ทราบอย่างชัดเจน ก่อนจะเริ่มดำเนินการเปลี่ยนแปลง
            </Typography>

            <Typography variant="h4">8. ช่องทางการติดต่อ</Typography>
            <Typography variant="body2">
              กองกิจกรรมทางกายเพื่อสุขภาพ 88/22 อาคาร 7 ชั้น 7 กรมอนามัย
              ถนนติวานนท์ อำเภอเมือง จังหวัดนนทบุรี
            </Typography>
            <Typography variant="body2">
              Email : Activefam.dopah@gmail.com
            </Typography>
            <Typography variant="body2">
              เบอร์โทรติดต่อ : 02 590 4413
            </Typography>

          </Box>
        <ButtonProps
          titlebutton="ยินยอม"
          maxwidthbtn="167px"
          widthbtn="100%"
          marginbtn="30px auto 0"
          heightbtn="40px"
          background="linear-gradient(to top, #8CA51E,  #D0FD08)"
        />
      </Box>
    </InnerLayout>
  );
};

export default ConditionsPage;
